const { default: mongoose, Schema } = require("mongoose");
const { db_url } = require("../../../../../configs/db.config");
const Model = require("../model/model");
const blogCategoriesModel = require("../../blog_categories/model/model");

var uni = [];
const gen_rand = () => {
	let rand = Math.floor(Math.random() * 7);
	if (rand == 0 || uni.includes(rand)) {
		rand = gen_rand();
	}
	uni.push(rand);
	return rand;
};

async function getId() {
	// Get a random entry
	var random = gen_rand();
	var data = await blogCategoriesModel.find().limit(1).skip(random);
	console.log(random, data[0]._id);
	return [data.map(i => i._id),"655dc56cdfef49c66bc28b5f"];
}

// node app/api/blog/blogs/seeder/seeder.js
// console.log("hi hello");


let data = [

	{
		title: "কেমন আছেন আল মাহমুদ",
		subtitle: "আল মাহমুদের মতো কবি যুগে যুগে জন্মায় না। বহু প্রতীক্ষার পর একজন বড় কবির আবির্ভাব ঘটে। একটি জাতির জন্য এটি…",
		short_description: `<p>আল মাহমুদের মতো কবি যুগে যুগে জন্মায় না। বহু প্রতীক্ষার পর একজন বড় কবির আবির্ভাব ঘটে। একটি জাতির জন্য এটি গৌরবের। একটি দেশের জন্য সম্পদ। যদি সে জাতি এবং সে দেশ বোঝে। অনুভব করে। ব্যক্তি আল মাহমুদ নিয়ে কথা আছে। থাকতেই পারে। কিন্তু কবি আল মাহমুদ সব বিতর্কের ঊর্ধ্বে। তার কবিতার মধুর শরাব পান করেননি বাংলাভাষী এমন শিক্ষিত মানুষ কমই আছেন</p>`,
		description: `তিনি কবিতার জগতে এতটা উচ্চতায় নিয়েছেন নিজেকে যে, তাকে নিয়ে লিখতেই হয়। বলতেই হয়। আড্ডায় আসরে আলোচনায় তাকে উচ্চারণ করতে হয়। উপমা দিতে হয় তার কথা। তার কবিতা থেকে দিতে হয় উদাহরণ। তিনি নিজেকে নির্মাণ করেছেন তিলে তিলে। তার নির্মিত কাব্যিক প্রাসাদ বেশ উঁচু। তাকে অবহেলা করার কিছু নেই। অবজ্ঞারও নেই কিছু। তার যত নাম অনাম সুনাম বদনামÑ সবই কবিতা ঘিরে। প্রশংসা-নিন্দাও কবিতার জন্যই। তিনি কবি এবং একজন অসাধারণ কবি। তিনি আল মাহমুদ।

		ক’দিন ধরে বেশ কিছু পত্রিকা, অনলাইন, নিউজ পোর্টাল এবং ফেসবুকে বেশ লেখালেখি দেখেছি আল মাহমুদকে ঘিরে। তিনি লেখার বিষয়। তাকে নিয়ে লিখতেই হয়। লিখতে হবে। কথায় আছে, মৃত্যুর পরও পৃথিবীতে বেঁচে থাকার উপায় দু’টি অথবা দু’টির যেকোনো একটি। হয় এমন কিছু লিখে যাও, যা মানুষ পড়বে। অথবা এমন কিছু করে যাও মানুষ লিখবে। তার মানে অক্ষরে জেগে থাকা ছাড়া বেঁচে থাকার আর কোনো পথ নেই। আল মাহমুদ শব্দের আনন্দে যা নির্মাণ করেছেন, তা মানুষকে পড়তে হয়। হয়তো পড়তে হবে আগামী প্রজন্মকেও। পাশাপাশি তার লেখালেখি কর্মের গৌরব নিয়ে লিখতেও হবে। সুতরাং তাকে নিয়ে লেখালেখি হবে এটা খুবই স্বাভাবিক।
		কিন্তু বিভিন্নভাবে এ ক’দিন যেভাবে লেখালেখি হয়েছে তা স্বাভাবিক নয়। কোথাও মিথ্যের ছড়াছড়ি। কোথাও বিবেকহীনতা রয়েছে। একটি অনলাইন নিউজ করেছে- আল মাহমুদ গ্রামের বাড়িতে পড়ে আছেন নিঃসঙ্গ। তিনি অবহেলার শিকার। তাকে দেখাশোনার কেউ নেই। তার ছেলেরাও দেখছে না। কেউ নিউজ করেছেন- আল মাহমুদের অবস্থা করুণ। তার যথার্থ যত্ন নিচ্ছে না কেউ। অতি আবেগ থেকে কেউ কেউ বিছানায় শায়িত অথবা ঘুমন্ত আল মাহমুদের ছবি পোস্ট করেছেন ফেসবুকে। লিখেছেন- দেখুন, কী করুণ আল মাহমুদ! এসব মিথ্যা বানোয়াট ও উদ্দেশ্যমূলক খবর এবং অবিবেচক ও মাত্রাজ্ঞানহীন নিউজ একজন কবির পক্ষে অবশ্যই সম্মানজনক নয়।</p>`,
		photo: "/uploads/posts/1.jpg",
		photo_alt_text: "photo",
		seo_title: "আল মাহমুদ",
		seo_keyword: "আল মাহমুদ",
		seo_description: "আল মাহমুদ",
		seo_schema_tags: "আল মাহমুদ",
		published_date: "2023-06-14",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "মহাকাব্য প্যারাডাইস লস্ট ও জন মিলটন",
		subtitle: "১৬০৮ সালের ৯ ডিসেম্বর ইংল্যান্ডের লন্ডন শহরের ব্রেড স্ট্রিটে জন্মগ্রহণ করেন ইংরেজি সাহিত্যের অন্যতম শ্রেষ্ঠ কবি জন মিলটন। তিনি ইংরেজি",
		short_description: `<p>১৬০৮ সালের ৯ ডিসেম্বর ইংল্যান্ডের লন্ডন শহরের ব্রেড স্ট্রিটে জন্মগ্রহণ করেন ইংরেজি সাহিত্যের অন্যতম শ্রেষ্ঠ কবি জন মিলটন। তিনি ইংরেজি সাহিত্যের অন্যতম প্রধান ও প্রভাবশালী কবি। শেক্সপিয়ারের পরেই যার স্থান বলে মনে করেন অনেকে। স্কুলের ছাত্র থাকাকালে মিলটন নিয়মিত পড়াশোনার পাশাপাশি লাতিন, গ্রিক, হিব্রু ভাষা ও সাহিত্য অধ্যয়ন করেন। সেই সাথে কাব্যচর্চাও শুরু করেন। ১৬২৬ সালে কলেজে পড়ার সময় তার প্রথম কবিতা প্রকাশিত হয়। তার সবচেয়ে বিখ্যাত ও কালোত্তীর্ণ সৃষ্টি মহাকাব্য Paradise Lost।</p>`,
		description: `<p>১৬০৮ সালের ৯ ডিসেম্বর ইংল্যান্ডের লন্ডন শহরের ব্রেড স্ট্রিটে জন্মগ্রহণ করেন ইংরেজি সাহিত্যের অন্যতম শ্রেষ্ঠ কবি জন মিলটন। তিনি ইংরেজি সাহিত্যের অন্যতম প্রধান ও প্রভাবশালী কবি। শেক্সপিয়ারের পরেই যার স্থান বলে মনে করেন অনেকে। স্কুলের ছাত্র থাকাকালে মিলটন নিয়মিত পড়াশোনার পাশাপাশি লাতিন, গ্রিক, হিব্রু ভাষা ও সাহিত্য অধ্যয়ন করেন। সেই সাথে কাব্যচর্চাও শুরু করেন। ১৬২৬ সালে কলেজে পড়ার সময় তার প্রথম কবিতা প্রকাশিত হয়। তার সবচেয়ে বিখ্যাত ও কালোত্তীর্ণ সৃষ্টি মহাকাব্য Paradise Lost। এ ছাড়া তার রচিত উল্লেখযোগ্য রচনাসমূহ হচ্ছে- কবিতাগ্রন্থ লাইসিডাস, প্যারাডাইস রিজেন্ট, স্যামসন এনিস্তে, লা এলেগ্র,কাব্যনাটক কমাস,গদ্য রচনা অব এডুকেশন, এরিওপোজিটিকা বিশেষভাবে উল্লেখযোগ্য।
		প্যারাডাইজ লস্ট মহাকাব্যটি মিলটনের সময় থেকে আজ অবধি ইংরেজ সাহিত্য-সমালোচনার কেন্দ্রেই রয়ে গেছে। ১৬৫৮ থেকে ১৬৬৪ সালের মধ্যে মিলটন তার মহাকাব্য প্যারাডাইজ লস্ট রচনা করেন।</p>`,
		photo: "/uploads/posts/2.jpg",
		photo_alt_text: "photo",
		seo_title: "জন মিলটন",
		seo_keyword: "জন মিলটন",
		seo_description: "জন মিলটন",
		seo_schema_tags: "জন মিলটন",
		published_date: "2023-07-11",
		categories: ['654c5d4e30dbb71ec3d78392', '655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "নির্জনতার কবি জীবনানন্দ দাশের জন্মদিনে",
		subtitle: "আমি কবি, সেই কবি-আকাশে কাতর আঁখি তুলি হেরিঝরাপালকের ছবি’ আজ নির্জনতার কবি জীবনানন্দ দাশের ১২৩তম জন্মদিন। রূপসী বাংলার কবি ১৯৯৯…",
		short_description: `<p>
		আজ নির্জনতার কবি জীবনানন্দ দাশের ১২৩তম জন্মদিন। রূপসী বাংলার কবি ১৯৯৯ সালের ১৭ ফেব্রুয়ারি বরিশাল জেলায় জন্মগ্রহণ করেন। তার মা কবি কুসুম কুমারী দাশ ও বাবার নাম সত্যানন্দ দাশ। তার মা কুসুম কুমারী দাশ কবি। জীবনানন্দ ১৯৫৪ সালের ২২ অক্টোবর ৫৫ বছর বয়সে কলকাতায় ট্রাম দুর্ঘটনায় মারা যান।</p>`,
		description: `<p>জীবনানন্দ বরিশাল ব্রজমোহন স্কুল থেকে ম্যাট্রিক (১৯১৫), বি এম কলেজ থেকে আইএ (১৯১৭) এবং কলকাতার প্রেসিডেন্সি কলেজ থেকে ইংরেজিতে অনার্সসহ বি.এ (১৯১৯) ও ইংরেজিতে এম.এ (১৯২১) পাস করেন। আইন কলেজে ভর্তি হলেও শেষ পর্যন্ত তিনি পরীক্ষা দেননি।


		জীবনানন্দ কলকাতা সিটি কলেজে ১৯২২ সালে ইংরেজি সাহিত্যে অধ্যাপনা শুরু করেন। ১৯২৯ সালে তিনি সদ্য প্রতিষ্ঠিত বাগেরহাট প্রফুল্লচন্দ্র কলেজে যোগ দেন, কিন্তু কিছু দিন পর চাকরি ছেড়ে কলকাতায় চলে যান। ওই বছরই (১৯২৯) তিনি দিল্লির রামযশ কলেজে যোগ দেন, ১৯৩০-এ আবার দেশে প্রত্যাবর্তন করেন। </p>`,
		photo: "/uploads/posts/3.jpg",
		photo_alt_text: "photo",
		seo_title: "জীবনানন্দ দাশ",
		seo_keyword: "জীবনানন্দ দাশ",
		seo_description: "জীবনানন্দ দাশ",
		seo_schema_tags: "জীবনানন্দ দাশ",
		published_date: "2023-07-11",
		categories: ['654c5d4e30dbb71ec3d78392','655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "‘কবি মল্লিক বাংলা গানের জগতে উজ্জ্বল নক্ষত্র’",
		subtitle: "গীতিকার, কবি ও সংগঠক আ জ ম ওবায়দুল্লাহ বলেছেন, মতিউর রহমান মল্লিক বাংলা গানের জগতে একটি উজ্জ্বল নক্ষত্র। যে নক্ষত্রের",
		short_description: `<p>যে নক্ষত্রের আলো বাংলা ভাষা ও সাহিত্য এবং বাঙালি জাতি যত দিন এই পৃথিবীতে থাকবে, তত দিন জ্বলতে থাকবে। তার গানের জাগরণের বাণী ও সুর আমাদের এবং আমাদের ভবিষ্যত প্রজন্মকে যুগের পর যুগ অনুপ্রাণিত করবে। সোমবার রাতে বাংলাদেশ কালচারাল একাডেমি আয়োজিত ‘কবি মতিউর রহমান মল্লিক স্মারক গ্রন্থের মোড়ক উন্মোচন ও সাংস্কৃতিক সন্ধ্যা’ অনুষ্ঠানে প্রধান অতিথির বক্তব্যে এ কথা বলেন।</p>`,
		description: `<p>বাংলাদেশ কালচারাল একাডেমির চেয়ারম্যান বাচিক শিল্পী শরীফ বায়জীদ মাহমুদের সভাপতিত্বে এ অনুষ্ঠানে স্বাগত বক্তব্য রাখেন একাডেমির সেক্রেটারি কবি ইবরাহিম বাহারী।

		শুভেচ্ছা বক্তব্য রাখেন কবি আসাদ বিন হাফিজ, গীতিকার অধ্যাপক আবু তাহের বেলাল, কবি শহীদ সিরাজী প্রমুখ।
		
		সভাপতির বক্তব্যে শরীফ বায়জীদ মাহমুদ বলেন, আমাদের সাংস্কৃতির চর্চার লক্ষ্য শুধুমাত্র চিত্ত বিনোদন নয়,আমাদের লক্ষ্য চিত্ত পরিশুদ্ধ করা। কবি মতিউর রহমান মল্লিকের গান কবিতায় চিত্ত পরিশুদ্ধ করার সমৃদ্ধ উপাদান আছে।</p>`,
		photo: "/uploads/posts/4.jpg",
		photo_alt_text: "photo",
		seo_title: "কবি মল্লিক",
		seo_keyword: "কবি মল্লিক",
		seo_description: "কবি মল্লিক",
		seo_schema_tags: "কবি মল্লিক",
		published_date: "2023-07-11",
		categories: ['654c5d4e30dbb71ec3d78392','655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "আরবি নিউজ অনুবাদ শেখার অনবদ্য বই ‘মিডিয়া আরবি শিখি’",
		subtitle: "কোরআন-হাদিস চর্চার পাশাপাশি আরবি শিক্ষার্থীদের মধ্যে ইদানিং আরবি পত্র-পত্রিকা পাঠ ও সেখান থেকে নিউজ অনুবাদের আগ্রহ আগের যেকোনো সময়ের তুলনায়",
		short_description: `<p>কোরআন-হাদিস চর্চার পাশাপাশি আরবি শিক্ষার্থীদের মধ্যে ইদানিং আরবি পত্র-পত্রিকা পাঠ ও সেখান থেকে নিউজ অনুবাদের আগ্রহ আগের যেকোনো সময়ের তুলনায় বেড়েছে। সে লক্ষে ইতিপূর্বে বাজারে এসেছে বেশ কয়েকটি ‘অনুবাদ শেখার আরবি-বাংলা বই’। সেগুলো থেকে শিক্ষার্থীরা যথাসম্ভব উপকৃতও হয়েছে। কিন্তু এরই মধ্যে আরবি থেকে বাংলায় নিউজ অনুবাদের জন্য নতুন আরেকটি বই প্রকাশিত হয়েছে। দেশের তরুণ আলেম ও আরবি ভাষাবিদ শফিকুল ইসলাম আল ইমদাদী লিখিত এ বইয়ের নাম ‘মিডিয়া আরবি শিখি’।</p>`,
		description: `<p>বইটি প্রকাশের আগে তাতে থাকা প্রতিটি নিউজ লেখকের ফেসবুকে দেয়া হতো, তখন থেকেই আরবি নিউজ অনুবাদের সাথে সম্পৃক্ত তরুণরা তাকে একটি বই করার আহবান জানান। সেখান থেকে অনুপ্রাণিত হয়েই শফিকুল ইসলাম আল ইমদাদীর ‘মিডিয়া আরবি শিখি’-এর জন্ম।


		নিউজ অনুবাদের সাথে সম্পৃক্ত একাধিক তরুণ বইটি সম্পর্কে জানিয়েছেন, আগের বইগুলোর চেয়ে এটি বেশ সহজ ও সাবলীল। অধিক প্রয়োজনীয় ও তুলনামূলক সহজ নিউজগুলো পূর্ণাঙ্গ অনুবাদের পাশাপাশি শব্দে শব্দেও অনুবাদ করা হয়েছে, যা অনুবাদের প্রাথমিক শিক্ষার্থীর জন্য খুবই উপকারী ও ফলদায়ক হবে। সে হিসেবে এ পর্যন্ত বাংলায় রচিত অনুবাদের অন্যান্য বইয়ের চেয়ে এটি অনন্য ও অনবদ্য।</p>`,
		photo: "/uploads/posts/5.jpg",
		photo_alt_text: "photeo",
		seo_title: "আরবি নিউজ",
		seo_keyword: "আরবি নিউজ",
		seo_description: "আরবি নিউজ",
		seo_schema_tags: "আরবি নিউজ",
		published_date: "2023-07-01",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "মানবজীবনে ট্র্যাজেডি",
		subtitle: "মৃত্যুর আগ পর্যন্তু মানুষের বেঁচে থাকাকে বলা হয় মানবজীবন। জগতের শ্রেষ্ঠ জীবন মানবজীবন। অন্যান্য প্রাণী থেকে মানুষ এ জন্য আলাদা",
		short_description: `<p>মৃত্যুর আগ পর্যন্তু মানুষের বেঁচে থাকাকে বলা হয় মানবজীবন। জগতের শ্রেষ্ঠ জীবন মানবজীবন। অন্যান্য প্রাণী থেকে মানুষ এ জন্য আলাদা যে, তাদের সুখ ও দুঃখ ভোগ করার একটা ভিন্নরকমের অনুভূতি রয়েছে। চরম সুখে মানুষ পুলকিত হতে পারে আবার কঠিন দুঃখে মানুষ মুষরে পড়তে পারে। যার যার মতো করে মানুষ সুখী হয় আবার এই মানুষই যার যার মতো করে দুঃখ ভোগ করে। এই বৈশিষ্ট্যই মানবজীবনকে অন্যান্য প্রাণী থেকে আলাদা করে রেখেছে।</p>`,
		description: `<p> কিছু মানুষ রয়েছে যারা সারা জীবনই সুখ ভোগ করতে পারে আর কিছু মানুষ রয়েছে সারা জীবনই দুঃখ-কষ্টে বেঁচে থাকেন। কোনো মানুষের জীবনে কোনো একসময় সুখ ধরা দিতে পারে আবার দুঃখও তেমনি করে হঠাৎ জীবনের দরজায় কড়া নাড়তে পারে। সুখ ও দুঃখ এভাবেই নিজ নিজ গন্তব্য ঠিক করে নিয়ে আবর্তিত হতে থাকে। সুখ কী আর দুঃখইবা কাকে বলে এ নিয়েও বিস্তর মতপার্থক্য রয়েছে। তবে ছোট ছোট সুখ এবং ছোট ছোট দুঃখের কোনো সংজ্ঞা দেয়া যায় না। এগুলো আপেক্ষিক। বড় বড় দুঃখের সংজ্ঞা না হলেও সেসব দুঃখকে দেখা যায়। ছোট ছোট সুখ; ছোট ছোট দুঃখ প্রায় সব মানুষের মধ্যেই কমবেশি অবস্থান করে। কিন্তু বড় বড় সুখ ও বড় বড় দুঃখ বাসা বাঁধতে পারে বড় বড় মানুষের জীবনে। মহৎ ব্যক্তিত্বের সুখ ও দুঃখ আস্বাদনের মাত্রা সাধারণ মানুষের তুলনায় ভিন্নতর হয়ে থাকে। জীবনবোধের অনুভূতি যত গভীর হয় সুখ ও দুঃখ বোধের পরিমাণও ততই গভীর হতে পারে। পাহাড়কে নিশ্চিহ্ন করতে বড় শক্তির প্রয়োজন পড়ে।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "photo2",
		seo_title: "মানবজীবনে ট্র্যাজেডি",
		seo_keyword: "মানবজীবনে ট্র্যাজেডি",
		seo_description: "মানবজীবনে ট্র্যাজেডি",
		seo_schema_tags: "মানবজীবনে ট্র্যাজেডি",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},

	{
		title: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		subtitle: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম হলো এমন একটি পরিকল্পনা বা প্রক্রিয়া যা নিয়েছে উন্নতি এবং সামাজিক উন্নয়নের লক্ষ্যে সাম্প্রদায়িক সম্প্রেক্ষে একটি নির্দিষ্ট অঞ্চলে বা সমাজে চালানো হয়।",
		short_description: `<p>সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম হলো এমন একটি পরিকল্পনা বা প্রক্রিয়া যা নিয়েছে উন্নতি এবং সামাজিক উন্নয়নের লক্ষ্যে সাম্প্রদায়িক সম্প্রেক্ষে একটি নির্দিষ্ট অঞ্চলে বা সমাজে চালানো হয়। এই প্রোগ্রামগুলি সাধারণত শিক্ষা, স্বাস্থ্য, অর্থনৈতিক উন্নয়ন, সামাজিক সমস্যা সমাধান, পরিবেশ সংরক্ষণ, কৃষি ও গ্রামীণ উন্নয়ন ইত্যাদির মাধ্যমে সাম্প্রদায়িক উন্নয়নে মানুষের জীবনস্তর বাড়াতে হয়।এই প্রোগ্রামগুলির মাধ্যমে অনেক ধরনের কাজ করা হয়, যেমনঃ১. শিক্ষা ও প্রশিক্ষণ: সাম্প্রদায়িক উন্নয়নের প্রোগ্রাম যাতে শিক্ষা এবং প্রশিক্ষণের সুযোগ প্রদান করে।
		২. স্বাস্থ্য ও পরিবেশ সংরক্ষণ: সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম যাতে স্বাস্থ্য সেবা প্রদান করা হয় এবং পরিবেশ সংরক্ষণে প্রচেষ্টা করা হয়।</p>`,
		description: `<p>সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম হলো এমন একটি পরিকল্পনা বা প্রক্রিয়া যা নিয়েছে উন্নতি এবং সামাজিক উন্নয়নের লক্ষ্যে সাম্প্রদায়িক সম্প্রেক্ষে একটি নির্দিষ্ট অঞ্চলে বা সমাজে চালানো হয়। এই প্রোগ্রামগুলি সাধারণত শিক্ষা, স্বাস্থ্য, অর্থনৈতিক উন্নয়ন, সামাজিক সমস্যা সমাধান, পরিবেশ সংরক্ষণ, কৃষি ও গ্রামীণ উন্নয়ন ইত্যাদির মাধ্যমে সাম্প্রদায়িক উন্নয়নে মানুষের জীবনস্তর বাড়াতে হয়।

		এই প্রোগ্রামগুলির মাধ্যমে অনেক ধরনের কাজ করা হয়, যেমনঃ১. শিক্ষা ও প্রশিক্ষণ: সাম্প্রদায়িক উন্নয়নের প্রোগ্রাম যাতে শিক্ষা এবং প্রশিক্ষণের সুযোগ প্রদান করে।
		২. স্বাস্থ্য ও পরিবেশ সংরক্ষণ: সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম যাতে স্বাস্থ্য সেবা প্রদান করা হয় এবং পরিবেশ সংরক্ষণে প্রচেষ্টা করা হয়।
		৩. অর্থনৈতিক উন্নয়ন: আর্থিক সম্পদ ও উন্নয়নে সামাজিক উন্নয়নের প্রোগ্রাম যাতে সম্প্রদায় উন্নতি করতে পারে।
		৪. গ্রামীণ উন্নয়ন: গ্রামীণ অঞ্চলে উন্নয়নের প্রোগ্রাম যাতে গ্রামীণ সমাজের উন্নতি সম্পর্কে কাজ করা হয়।এই প্রোগ্রামগুলি সাম্প্রদায়িক সম্প্রেক্ষে মানুষের সামাজিক, আর্থিক এবং পরিবেশ সম্পর্কে বিভিন্ন সেক্টরে সহায়তা ও উন্নয়নের প্রয়োজনীয় পদক্ষেপ গ্রহণ করে।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		seo_title: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		seo_keyword: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		seo_description: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		seo_schema_tags: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "শিক্ষা ও দক্ষতা উন্নয়ন",
		subtitle: "শিক্ষা ও দক্ষতা উন্নয়ন হলো এমন প্রক্রিয়া বা কর্মসূচি যার মাধ্যমে মানুষদের শিক্ষার অংশগ্রহণ এবং দক্ষতা উন্নয়ন হয়। ",
		short_description: `<p>শিক্ষা ও দক্ষতা উন্নয়ন হলো এমন প্রক্রিয়া বা কর্মসূচি যার মাধ্যমে মানুষদের শিক্ষার অংশগ্রহণ এবং দক্ষতা উন্নয়ন হয়। এটি একটি প্রাথমিক এবং অত্যন্ত গুরুত্বপূর্ণ কার্যক্রম যা বিভিন্ন স্তরের মানুষের শিক্ষার মাধ্যমে তাদের দক্ষতা এবং জ্ঞানের বৃদ্ধি করে।শিক্ষা ও দক্ষতা উন্নয়নে সাধারণত নিম্নলিখিত কাজগুলি অন্তর্ভুক্ত থাকে:১. প্রাথমিক ও মাধ্যমিক শিক্ষা: বাচ্চাদের জন্য শিক্ষার আধারভূত মাধ্যমিক শিক্ষা প্রদান।
		২. উচ্চ শিক্ষা: বিশ্ববিদ্যালয়ের মাধ্যমে প্রফেশনাল ও বিষয়াগত শিক্ষা প্রদান।
		৩. প্রশিক্ষণ ও কাজের দক্ষতা: কাজের দক্ষতা ও প্রশিক্ষণ দিয়ে যে কোনও নিয়োগ বা পেশা সংক্রান্ত দক্ষতা উন্নয়ন।</p>`,
		description: `<p>শিক্ষা ও দক্ষতা উন্নয়ন হলো এমন প্রক্রিয়া বা কর্মসূচি যার মাধ্যমে মানুষদের শিক্ষার অংশগ্রহণ এবং দক্ষতা উন্নয়ন হয়। এটি একটি প্রাথমিক এবং অত্যন্ত গুরুত্বপূর্ণ কার্যক্রম যা বিভিন্ন স্তরের মানুষের শিক্ষার মাধ্যমে তাদের দক্ষতা এবং জ্ঞানের বৃদ্ধি করে।
		শিক্ষা ও দক্ষতা উন্নয়নে সাধারণত নিম্নলিখিত কাজগুলি অন্তর্ভুক্ত থাকে:১. প্রাথমিক ও মাধ্যমিক শিক্ষা: বাচ্চাদের জন্য শিক্ষার আধারভূত মাধ্যমিক শিক্ষা প্রদান।
		২. উচ্চ শিক্ষা: বিশ্ববিদ্যালয়ের মাধ্যমে প্রফেশনাল ও বিষয়াগত শিক্ষা প্রদান।
		৩. প্রশিক্ষণ ও কাজের দক্ষতা: কাজের দক্ষতা ও প্রশিক্ষণ দিয়ে যে কোনও নিয়োগ বা পেশা সংক্রান্ত দক্ষতা উন্নয়ন।
		৪. প্রশিক্ষণ ও সেমিনার: নতুন বিষয়ের জন্য প্রশিক্ষণ ও সেমিনার অনুষ্ঠান করা।
		৫. পেশাদার শিক্ষা: বিভিন্ন পেশার সম্পর্কে বিশেষজ্ঞতা অর্জনের জন্য শিক্ষার সুযোগ উন্নত করা।শিক্ষা ও দক্ষতা উন্নয়নের মাধ্যমে মানুষের মানসিক এবং পেশাগত প্রস্তুতি বৃদ্ধি করা হয় এবং তারা সমাজের উন্নতির জন্য প্রস্তুতি করা হয়।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "শিক্ষা ও দক্ষতা উন্নয়ন",
		seo_title: "শিক্ষা ও দক্ষতা উন্নয়ন",
		seo_keyword: "শিক্ষা ও দক্ষতা উন্নয়ন",
		seo_description: "শিক্ষা ও দক্ষতা উন্নয়ন",
		seo_schema_tags: "শিক্ষা ও দক্ষতা উন্নয়ন",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "স্বাস্থ্য সেবা",
		subtitle: "স্বাস্থ্য সেবা হলো মানুষের স্বাস্থ্যসম্পর্কিত যেকোনো সেবা ",
		short_description: `<p>স্বাস্থ্য সেবা হলো মানুষের স্বাস্থ্যসম্পর্কিত যেকোনো সেবা বা সুযোগ যা মানুষদের স্বাস্থ্য সম্পর্কে সাহায্য ও যত্ন প্রদান করে। এটি বিভিন্ন ধরনের সেবা ও সুযোগ যেমন চিকিৎসা, প্রতিরক্ষা, প্রচার-প্রসার, প্রশিক্ষণ ইত্যাদি যা মানুষের স্বাস্থ্যকে উন্নত করতে সাহায্য করে।স্বাস্থ্য সেবা অনেক বিভিন্ন রূপে প্রদান করা হয়, যেমনঃ১. চিকিৎসা ও পরামর্শ: রোগীদের জন্য নিউনার্সিং কেয়ার, ডাক্তারি পরামর্শ, অ্যাম্বুলেন্স সেবা ইত্যাদি।</p>`,
		description: `<p>স্বাস্থ্য সেবা হলো মানুষের স্বাস্থ্যসম্পর্কিত যেকোনো সেবা বা সুযোগ যা মানুষদের স্বাস্থ্য সম্পর্কে সাহায্য ও যত্ন প্রদান করে। এটি বিভিন্ন ধরনের সেবা ও সুযোগ যেমন চিকিৎসা, প্রতিরক্ষা, প্রচার-প্রসার, প্রশিক্ষণ ইত্যাদি যা মানুষের স্বাস্থ্যকে উন্নত করতে সাহায্য করে।স্বাস্থ্য সেবা অনেক বিভিন্ন রূপে প্রদান করা হয়, যেমনঃ১. চিকিৎসা ও পরামর্শ: রোগীদের জন্য নিউনার্সিং কেয়ার, ডাক্তারি পরামর্শ, অ্যাম্বুলেন্স সেবা ইত্যাদি।
		২. প্রতিরক্ষা ও প্রচার-প্রসার: স্বাস্থ্য সচেতনতা বাড়ানো, প্রশ্নোত্তর অনুষ্ঠান, ওয়েবসাইট ও সোশ্যাল মিডিয়া প্রচারের মাধ্যমে জনগণের সাথে স্বাস্থ্য সম্পর্কিত তথ্য ভাগাভাগি করা।
		৩. শিক্ষা ও প্রশিক্ষণ: স্বাস্থ্য সচেতনতা বাড়ানো, প্রাকৃতিক সাবলীলতা, নিজের যত্ন নেওয়া ইত্যাদি শিক্ষা দেওয়া।
		৪. চিকিৎসাধীন পরিচর্যা ও রেসার্চ: সাইন্টিফিক রিসার্চ, নতুন চিকিৎসাধীন পদ্ধতি অনুসন্ধান এবং বিজ্ঞানীগণের কাজ সহায়তা করা।
		৫. কর্মস্থলীয় স্বাস্থ্য পরিচর্যা: কর্মস্থলে স্বাস্থ্য পরিচর্যা প্রদান করা যাতে কর্মীরা সুস্থ থাকেন এবং কাজের দায়িত্ব ঠিকমত পালন করতে পারেন।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "স্বাস্থ্য সেবা",
		seo_title: "স্বাস্থ্য সেবা",
		seo_keyword: "স্বাস্থ্য সেবা",
		seo_description: "স্বাস্থ্য সেবা",
		seo_schema_tags: "স্বাস্থ্য সেবা",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবা",
		subtitle: "প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবা হলো সেবামূলক কাজের একটি অংশ ",
		short_description: `<p>প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবা হলো সেবামূলক কাজের একটি অংশ যা অসহায়, দুর্বল, প্রতিবন্ধী বা প্রতিষ্ঠানিক সংগঠনের জন্য প্রদান করা হয়। এই ধরনের সেবা সাধারণত অনুশাসনিক ও প্রতিষ্ঠানিক সংগঠন, সরকারী প্রতিষ্ঠান, গৈর-সরকারী সংগঠন বা স্বেচ্ছাসেবী সংগঠনের মাধ্যমে প্রদান করা হয়।এই প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবাগুলির মধ্যে নিম্নলিখিত কিছু অংশ অন্তর্ভুক্ত থাকতে পারে: দুর্বল সম্প্রদায়ের জন্য সেবা: বৃদ্ধ ব্যক্তিদের, অনুপস্থিত ব্যক্তিদের, প্রতিবন্ধী ব্যক্তিদের জন্য বিভিন্ন সেবা প্রদান করা।</p>`,
		description: `<p>প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবা হলো সেবামূলক কাজের একটি অংশ যা অসহায়, দুর্বল, প্রতিবন্ধী বা প্রতিষ্ঠানিক সংগঠনের জন্য প্রদান করা হয়। এই ধরনের সেবা সাধারণত অনুশাসনিক ও প্রতিষ্ঠানিক সংগঠন, সরকারী প্রতিষ্ঠান, গৈর-সরকারী সংগঠন বা স্বেচ্ছাসেবী সংগঠনের মাধ্যমে প্রদান করা হয়।এই প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবাগুলির মধ্যে নিম্নলিখিত কিছু অংশ অন্তর্ভুক্ত থাকতে পারে:
		১. দুর্বল সম্প্রদায়ের জন্য সেবা: বৃদ্ধ ব্যক্তিদের, অনুপস্থিত ব্যক্তিদের, প্রতিবন্ধী ব্যক্তিদের জন্য বিভিন্ন সেবা প্রদান করা।
		২. স্বাস্থ্য ও চিকিৎসা সেবা: অসুস্থ ও অসুস্থ ব্যক্তিদের জন্য চিকিৎসা, পরামর্শ, ঔষধ ও হাসপাতালের সেবা।
		৩. শিক্ষামূলক ও প্রশিক্ষণ সেবা: শিক্ষার্থীদের জন্য স্কুল, কলেজ, টিউশন, ছাত্রদের জন্য দর্পণ, বিনামূল্যে প্রশিক্ষণ সেবা ইত্যাদি।
		৪. আদালতীয় ও আইনি সেবা: অস্বীকৃত ব্যক্তিদের জন্য বিনামূল্যে আইনি সেবা প্রদান করা, আইনী পরামর্শ দেওয়া, বিচারাধীন ব্যক্তিদের জন্য সাহায্য করা ইত্যাদি।
		৫. অন্যান্য সেবা: ভাতা ও অনুদান, কর্মসংস্থান, অনুপ্রাণিত ব্যক্তিদের জন্য পেশাগত সহায়তা, দরিদ্র ব্যক্তিদের জন্য খাদ্য ও পানীয় সরবরাহ ইত্যাদি।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "প্রতিবন্ধী ও প্রতিষ্ঠানিক",
		seo_title: "প্রতিবন্ধী ও প্রতিষ্ঠানিক",
		seo_keyword: "প্রতিবন্ধী ও প্রতিষ্ঠানিক",
		seo_description: "প্রতিবন্ধী ও প্রতিষ্ঠানিক",
		seo_schema_tags: "প্রতিবন্ধী ও প্রতিষ্ঠানিক",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "দুর্যোগ ব্যবস্থা এবং সাহায্য",
		subtitle: " দুর্যোগ ব্যবস্থা ও সাহায্য হলো সেসব পদক্ষেপ এবং পরিকল্পনা যা কোনও প্রাকৃতিক",
		short_description: `<p>
		দুর্যোগ ব্যবস্থা ও সাহায্য হলো সেসব পদক্ষেপ এবং পরিকল্পনা যা কোনও প্রাকৃতিক বা মানুষিক দুর্যোগের সময় মানুষদের সহায়তা করার জন্য নেয়া হয়। এটি বিভিন্ন রকম দুর্যোগের সময় জনগণের প্রাণনাশ বা সম্পদের ক্ষতির পরিস্থিতি তৈরি হতে পারে এবং সেগুলির সাম্প্রতিক পরিস্থিতিতে প্রভাবশালী হতে পারে।দুর্যোগ ব্যবস্থায় নিম্নলিখিত কাজগুলি অন্তর্ভুক্ত থাকতে পারে:প্রতিরক্ষা পরিকল্পনা: জনগণের জন্য প্রাকৃতিক বা মানুষিক দুর্যোগের পূর্বাভাস ও প্রতিরোধে পরিকল্পনা অবদান রাখা।
		</p>`,
		description: `<p>দুর্যোগ ব্যবস্থা ও সাহায্য হলো সেসব পদক্ষেপ এবং পরিকল্পনা যা কোনও প্রাকৃতিক বা মানুষিক দুর্যোগের সময় মানুষদের সহায়তা করার জন্য নেয়া হয়। এটি বিভিন্ন রকম দুর্যোগের সময় জনগণের প্রাণনাশ বা সম্পদের ক্ষতির পরিস্থিতি তৈরি হতে পারে এবং সেগুলির সাম্প্রতিক পরিস্থিতিতে প্রভাবশালী হতে পারে।দুর্যোগ ব্যবস্থায় নিম্নলিখিত কাজগুলি অন্তর্ভুক্ত থাকতে পারে:প্রতিরক্ষা পরিকল্পনা: জনগণের জন্য প্রাকৃতিক বা মানুষিক দুর্যোগের পূর্বাভাস ও প্রতিরোধে পরিকল্পনা অবদান রাখা।
		মানবিক সাহায্য ও সংস্থাগত প্রতিস্থাপন: দুর্যোগের পর মানবিক সাহায্য, খাদ্য ও পানীয় সরবরাহ, আশ্রয় ও মেডিকেল সাহায্যের ব্যবস্থা।দুর্যোগ প্রতিকার: দুর্যোগের সময় তাৎক্ষণিক প্রতিকারের ব্যবস্থা এবং কাটাকুটির সাহায্য প্রদান।প্রতিরক্ষা পর্যায়ের সংস্থাগত ব্যবস্থা: দুর্যোগ সময়ে সংস্থাগত প্রতিরক্ষা পরিকল্পনা অনুষ্ঠানের ব্যবস্থা।প্রচেষ্টা কর্মসূচি: প্রাকৃতিক দুর্যোগের পরিস্থিতিতে জনগণের মধ্যে সচেতনতা বাড়ানো এবং তাদের প্রতিরক্ষা ক্ষমতা বৃদ্ধি করা।
		দুর্যোগ প্রবন্ধনা ও তদন্ত: দুর্যোগের পর ঘটনা ও তার পরিস্থিতির তদন্ত, পর্যবেক্ষণ ও মূল্যায়ন করা।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "দুর্যোগ ব্যবস্থা",
		seo_title: "দুর্যোগ ব্যবস্থা",
		seo_keyword: "দুর্যোগ ব্যবস্থা",
		seo_description: "দুর্যোগ ব্যবস্থা",
		seo_schema_tags: "দুর্যোগ ব্যবস্থা",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "পরিবেশ সংরক্ষণ",
		subtitle: " পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ",
		short_description: `<p>পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ যা মানুষের ও প্রাকৃতিক পরিবেশের সমন্বয়ে ব্যবস্থা করে। এটি প্রাকৃতিক সম্পদ, জীব বৈচিত্র্য, বায়ু, জল এবং মাটির সুরক্ষা ও সংরক্ষণের জন্য বিভিন্ন ধরনের কর্মকাণ্ড এবং নৈতিক দায়িত্ব নিয়ে ব্যাপক অর্থে প্রয়োজনীয়। পরিবেশ সংরক্ষণের উদ্দেশ্য হলো সামাজিক, আর্থিক, এবং পরিবেশের সাথে সামঞ্জস্য বজায় রাখা।</p>`,
		description: `<p> পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ যা মানুষের ও প্রাকৃতিক পরিবেশের সমন্বয়ে ব্যবস্থা করে। এটি প্রাকৃতিক সম্পদ, জীব বৈচিত্র্য, বায়ু, জল এবং মাটির সুরক্ষা ও সংরক্ষণের জন্য বিভিন্ন ধরনের কর্মকাণ্ড এবং নৈতিক দায়িত্ব নিয়ে ব্যাপক অর্থে প্রয়োজনীয়। পরিবেশ সংরক্ষণের উদ্দেশ্য হলো সামাজিক, আর্থিক, এবং পরিবেশের সাথে সামঞ্জস্য বজায় রাখা। এটি বাস্তব জীবনে পরিবেশের সংরক্ষণে লোকেরা সচেতন হতে উৎসাহিত করে এবং সুস্থ এবং সমৃদ্ধ পরিবেশের জন্য প্রতিবদ্ধ করে।

		পরিবেশ সংরক্ষণের কার্যক্রমে যাতে বিভিন্ন সমস্যা ও উপায় আসে, তা হলো:
		
		জলবায়ু পরিবর্তন: জলবায়ু পরিবর্তন নিয়ে সচেতনতা বাড়ানো, এর প্রভাবে মানুষের জীবন ও পরিবেশের পরিবর্তন জন্মানো।
		জল ও বায়ুর সংরক্ষণ: পানি ও বায়ুর স্বাস্থ্যগত গুনগত অবস্থা বজায় রাখার জন্য কাজ করা।
		জৈববৈচিত্র্য সংরক্ষণ: প্রাকৃতিক বাস্তবতার সংরক্ষণ ও জৈব বৈচিত্র্যের দিক থেকে অবদান রাখা।
		অতিরিক্ত জনসংখ্যার সাথে সম্প্রদায়ের সংমিলন: জনসংখ্যা বৃদ্ধি নিয়ে সচেতনতা বাড়ানো এবং সম্প্রদায়ের মধ্যে সামঞ্জস্য বজায় রাখা।
		প্রাকৃতিক দুর্যোগ নিরাপত্তা: প্রাকৃতিক দুর্যোগের প্রাকৃতিক প্রতিরক্ষা উন্নয়ন করা।
		প্রকৃতির সংরক্ষণে সম্প্রদায়ের ভূমিকা: প্রাকৃতিক সম্পদ ও সংরক্ষণের জন্য সম্প্রদায়ের অবদান বাড়ানো।
		প্রযুক্তি ব্যবহার: প্রযুক্তি ব্যবহার করে পরিবেশের সংরক্ষণে সাহায্য করা।
		শিক্ষা ও সচেতনতা: সামাজিক কর্ম</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "পরিবেশ সংরক্ষণ",
		seo_title: "পরিবেশ সংরক্ষণ",
		seo_keyword: "পরিবেশ সংরক্ষণ",
		seo_description: "পরিবেশ সংরক্ষণ",
		seo_schema_tags: "পরিবেশ সংরক্ষণ",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},

	{
		title: "বিপদ যখন নিয়ামাত",
		subtitle: " পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "বিপদ যখন নিয়ামাত",
		seo_title: "বিপদ যখন নিয়ামাত",
		seo_keyword: "বিপদ যখন নিয়ামাত",
		seo_description: "বিপদ যখন নিয়ামাত",
		seo_schema_tags: "বিপদ যখন নিয়ামাত",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		subtitle: " আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		seo_title: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		seo_keyword: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		seo_description: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		seo_schema_tags: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "বিপদ যখন নিয়ামাত",
		subtitle: " পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "বিপদ যখন নিয়ামাত",
		seo_title: "বিপদ যখন নিয়ামাত",
		seo_keyword: "বিপদ যখন নিয়ামাত",
		seo_description: "বিপদ যখন নিয়ামাত",
		seo_schema_tags: "বিপদ যখন নিয়ামাত",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "বিপদ যখন নিয়ামাত",
		subtitle: " পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "বিপদ যখন নিয়ামাত",
		seo_title: "বিপদ যখন নিয়ামাত",
		seo_keyword: "বিপদ যখন নিয়ামাত",
		seo_description: "বিপদ যখন নিয়ামাত",
		seo_schema_tags: "বিপদ যখন নিয়ামাত",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "বিপদ যখন নিয়ামাত",
		subtitle: " পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "বিপদ যখন নিয়ামাত",
		seo_title: "বিপদ যখন নিয়ামাত",
		seo_keyword: "বিপদ যখন নিয়ামাত",
		seo_description: "বিপদ যখন নিয়ামাত",
		seo_schema_tags: "বিপদ যখন নিয়ামাত",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},
	{
		title: "বিপদ যখন নিয়ামাত",
		subtitle: " পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "/uploads/posts/6.jpg",
		photo_alt_text: "বিপদ যখন নিয়ামাত",
		seo_title: "বিপদ যখন নিয়ামাত",
		seo_keyword: "বিপদ যখন নিয়ামাত",
		seo_description: "বিপদ যখন নিয়ামাত",
		seo_schema_tags: "বিপদ যখন নিয়ামাত",
		published_date: "2023-07-05",
		categories: ['655dc56cdfef49c66bc28b5f'],
		status: true,

	},

];

const run = async () => mongoose.connect(db_url)
	.then(async () => {
		console.log("\n");
		console.log("blogs seeding");

		await Model.deleteMany({});
		for (let i = 0; i < data.length; i++) {
			let item = data[i]
			item.categories = await getId()
			await Model.create(item);
		}

		// let response = await Model.insertMany(data);

		console.log("blogs seeding complete");

		console.log("\n");
	});

// run()
module.exports = async () =>  run()
