const { default: mongoose, Schema } = require("mongoose");
const { db_url } = require("../../../../../configs/db.config");
const Model = require("../model/model");

let data = [
	
	{
		title: "ইসলাম",
		short_description:"ইসলাম হলো একটি ধর্ম যা মুসলিমদের বিশ্বাস এবং অনুসরণ করার জন্য নির্ধারিত হয়েছে। এটি মুসলিমদের জীবনযাপনের নির্দেশিকা সরবরাহ করে এবং একটি সম্পূর্ণ জীবনযাপনের প্রতি অত্যন্ত গুরুত্ব দেয়।",
		long_description:"ইসলাম হলো একটি ধর্ম যা মুসলিমদের বিশ্বাস এবং অনুসরণ করার জন্য নির্ধারিত হয়েছে। এটি মুসলিমদের জীবনযাপনের নির্দেশিকা সরবরাহ করে এবং একটি সম্পূর্ণ জীবনযাপনের প্রতি অত্যন্ত গুরুত্ব দেয়।ইসলামের মৌলিক অংশ হলো একতা ও আল্লাহর অমীমাংসিত শক্তির বিশ্বাস। মুসলিমদের প্রাথমিক নৈতিক দলিলগুলি কুরআনে এবং হাদিসে প্রদর্শিত হয়। ইসলামের মূল আদর্শ সম্পর্কে বিস্তারিত ধারণা পেতে, মুসলিম সমাজ সাধারণত পঞ্চ পিল্লার (ইসলামের পাঁচটি মূল শ্রেণীবিন্যাস) এবং সুন্নাহের (প্রফেত মোহাম্মদ (সা:) অনুসরণের নির্দেশিকা) মাধ্যমে জীবনযাপন করে।",
		photo:"",
		seo_title:"ইসলাম",
		seo_keyword:"ইসলাম",
		seo_description:"ইসলাম",
		url: "blog-islam",
		status: true,
	},
	{
		title: "ইসলামী আন্দোলন",
		short_description:"ইসলামের ধর্মীয় অনুষ্ঠান, শ্রাদ্ধ, নৈতিক মূল্য, মুসলিম সমাজের সংগঠন, শিক্ষা এবং মানবিক উন্নয়নের ক্ষেত্রে বিভিন্ন ধরনের বিধান ও নির্দেশিকা ইসলামে বিবরণ করে।",
		long_description:"ইসলামের ধর্মীয় অনুষ্ঠান, শ্রাদ্ধ, নৈতিক মূল্য, মুসলিম সমাজের সংগঠন, শিক্ষা এবং মানবিক উন্নয়নের ক্ষেত্রে বিভিন্ন ধরনের বিধান ও নির্দেশিকা ইসলামে বিবরণ করে। এছাড়াও, ইসলামে মানবিকতার গুরুত্ব অনেক জনপ্রিয়। ইসলামে দান, মানবিক সহানুভূতি, ন্যায় এবং শান্তি ইত্যাদি মানবিক মৌলিক অধিকার ও মানবিক মূল্যের প্রতি অগ্রহণ করা হয়।",
		photo:"",
		seo_title:"ইসলামী আন্দোলন",
		seo_keyword:"ইসলামী আন্দোলন",
		seo_description:"ইসলামী আন্দোলন",
		url: "blog-islamic-movement",
		status: true,
	},
	{
		title: "বাংলাদেশ",
		short_description:"বাংলাদেশ হলো একটি দক্ষিণ এশিয়ার দেশ, যা দক্ষিণে ভারতের পশ্চিমে ও উত্তরে ভারতের অসম রাজ্যের সীমান্তে অবস্থিত।",
		long_description:"বাংলাদেশ হলো একটি দক্ষিণ এশিয়ার দেশ, যা দক্ষিণে ভারতের পশ্চিমে ও উত্তরে ভারতের অসম রাজ্যের সীমান্তে অবস্থিত। এটি বাংলা ভাষায় প্রধান ভাষা ও সংস্কৃতির নিত্যনতুন বাসভাব। বাংলাদেশ একটি সাংবিধানিকভাবে গণপ্রজাতন্ত্রিক প্রজাতন্ত্র। রাষ্ট্রের রাজধানী এবং বৃহত্তম শহর হলো ঢাকা।",
		photo:"",
		seo_title:"বাংলাদেশ",
		seo_keyword:"বাংলাদেশ",
		seo_description:"বাংলাদেশ",
		url: "blog-bangladesh",
		status: true,
	},
	{
		title: "রাজনীতি",
		short_description:"রাজনীতি হলো সমাজের বিভিন্ন স্তরে শাসন, কর্তৃত্ব, ও শক্তি বিতরণের প্রক্রিয়া ও কৌশল। এটি সমাজের বিভিন্ন সদস্যদের মধ্যে সমঞ্জস্যা ও সংঘাতের মাধ্যমে সরকার",
		long_description:"রাজনীতি হলো সমাজের বিভিন্ন স্তরে শাসন, কর্তৃত্ব, ও শক্তি বিতরণের প্রক্রিয়া ও কৌশল। এটি সমাজের বিভিন্ন সদস্যদের মধ্যে সমঞ্জস্যা ও সংঘাতের মাধ্যমে সরকাররাজনীতি বিভিন্ন ধর্ম, রাষ্ট্র, সমাজ ও সাংস্কৃতিতে পার্থক্য দেখায়। এটি একটি বিশাল শ্রেণীর বিষয়, যা নাগরিকদের স্বাধীনতা, অধিকার, দায়িত্ব, ও সরকারি নির্ণয়ের সাথে সংযুক্ত।",
		photo:"",
		seo_title:"রাজনীতি",
		seo_keyword:"রাজনীতি",
		seo_description:"রাজনীতি",
		url: "blog-politics",
		status: true,
	},
	{
		title: "ইতিহাস",
		short_description:"ইতিহাস হলো মানব সভ্যতা ও সমাজের ঘটনাবলীর অধ্যয়ন এবং অধ্যয়নের বিষয়ে একটি শাখা। ",
		long_description:"ইতিহাস হলো মানব সভ্যতা ও সমাজের ঘটনাবলীর অধ্যয়ন এবং অধ্যয়নের বিষয়ে একটি শাখা। এটি নানা ঘটনা, ব্যক্তিত্ব, সমাজ, রাজনীতি, অর্থনীতি, সাংস্কৃতিক অবস্থা, ও বিশেষতঃ ঘটনার পরিস্থিতি নিয়ে তথ্য সংগ্রহ করে।",
		photo:"",
		seo_title:"ইতিহাস",
		seo_keyword:"ইতিহাস",
		seo_description:"ইতিহাস",
		url: "blog-history",
		status: true,
	},
	{
		title: "সমসাময়িক",
		short_description:"ইতিহাস হলো মানব সভ্যতা ও সমাজের ঘটনাবলীর অধ্যয়ন এবং অধ্যয়নের বিষয়ে একটি শাখা। ",
		long_description:"ইতিহাস হলো মানব সভ্যতা ও সমাজের ঘটনাবলীর অধ্যয়ন এবং অধ্যয়নের বিষয়ে একটি শাখা। এটি নানা ঘটনা, ব্যক্তিত্ব, সমাজ, রাজনীতি, অর্থনীতি, সাংস্কৃতিক অবস্থা, ও বিশেষতঃ ঘটনার পরিস্থিতি নিয়ে তথ্য সংগ্রহ করে।",
		photo:"",
		seo_title:"সমসাময়িক",
		seo_keyword:"সমসাময়িক",
		seo_description:"সমসাময়িক",
		url: "contemporary",
		status: true,
	},
	{
		title: "বিবিধ",
		short_description:"দৈনন্দিন বিষয়াবলী নিয়ে আলোচনা",
		long_description:"দৈনন্দিন বিষয়াবলী নিয়ে আলোচনা",
		photo:"",
		seo_title:"বিবিধ",
		seo_keyword:"বিবিধ",
		seo_description:"বিবিধ",
		url: "blog-miscellaneous",
		status: true,
	},
];

module.exports = async () => mongoose.connect(db_url)
	.then(async () => {
		console.log("\n");
		console.log("blog categories seeding");

		await Model.deleteMany({});
		for (let i = 0; i < data.length; i++) {
			await Model.create(data[i]);
		}

		// let response = await Model.insertMany(data);

		console.log("blog categories seeding completeee");

		console.log("\n");
	});
